/*
 ********************************************************************************************************************
 *描述：    独立的CAN 控制器SJA1000PeliCAN模式库文件使用头文件
 *文件名:   SJA1000_PELI_APP.H
 *应用语言: KEIL C51
 *版本 :    V1.01
 *广州周立功单片机发展有限公司 保留所有的版权
 ********************************************************************************************************************
 */
/*
 ********************************************************************************************************************
 **预编译
 ********************************************************************************************************************
 */
 #ifndef	_SJA1000_PELI_APP_H
 #define	_SJA1000_PELI_APP_H

 #ifndef	_GLOBAL_SJA1000_PELI_APP_
 #define	GLOBAL_SJA1000_PELI_APP		extern
 #else
 #define	GLOBAL_SJA1000_PELI_APP
 #endif

 #ifndef	_SJA_PELICAN_MODE_
 #define	_SJA_PELICAN_MODE_
 #endif
 
#define can_addr ((UINT8 volatile far *) 0x310)	 //

#define SELECT_ADDR1	1  //(base + 0x11)	/*片选地址*/
#define DATA_ADDR1		0  //(base + 0x10)	/*读写数据地址*/
#define SELECT_ADDR2	0x21  //(base + 0x13)	/*片选地址*/
#define DATA_ADDR2		0x20  //(base + 0x12)	/*读写数据地址*/

 /*
 ********************************************************************************************************************
 * 定义sja1000帧格式的结构类型
 ********************************************************************************************************************
 */
 typedef	struct	{
			unsigned	char	DataLength	:4;			   //本次帧的数据dlc
			unsigned	char	ResverBit1	:1;
			unsigned	char	ResverBit2	:1;
			unsigned	char	FrameType 	:1;  			//帧格式类型;0=标准帧;1=扩展帧;
			unsigned	char	RTRFlag	  	:1;				//远程帧或数据帧标志;0=数据帧；1=远程帧；
			unsigned	long	FrameID;		  		    //报文识别码
			unsigned	char	Databuf[8];
	} SJAFrameStruct,  *P_SJAFrameStruct ;

	
typedef struct {
	unsigned char ChipNum;     //芯片号
	unsigned char BaudRate;    //波特率
	unsigned char ExtendedFrame;   //0,标准帧；1，扩展帧
	unsigned long ACR;         //验收校验ID  (真实值，右对齐)
	unsigned long AMR;				 //验收屏蔽寄存器，为1时任何id都能通过(真实值，右对齐)
} SJAConfigStruct;
/*
************************************************************************************************************************
**                           导入头文件
************************************************************************************************************************
*/
 #include	"FUNC.H"
 #include	"REG.H"
 #include	"OS.H"



/*
 ********************************************************************************************************************
 *                        SJA1000_PELI_APP定义结束
 ********************************************************************************************************************
 */
#endif

