/*
 ********************************************************************************************************************
 *ÃèÊö£º    ¶ÀÁ¢µÄCAN ¿ØÖÆÆ÷SJA1000¼Ä´æÆ÷ËµÃ÷Í·ÎÄ¼ş
 *ÎÄ¼şÃû:   SJA1000REG.H
 *Ó¦ÓÃÓïÑÔ: KEIL C51
 *°æ±¾ :    V1.01
 *¹ãÖİÖÜÁ¢¹¦µ¥Æ¬»ú·¢Õ¹ÓĞÏŞ¹«Ë¾ ±£ÁôËùÓĞµÄ°æÈ¨
 ********************************************************************************************************************
 */
#ifndef		_SJA1000REG_H
#define		_SJA1000REG_H

/*
 ********************************************************************************************************************
 *                        ÅĞ¶Ï¶¨ÒåBasicCANÄ£Ê½»¹ÊÇPeliCANÄ£Ê½
 ********************************************************************************************************************
 */
#ifdef		_SJA_PELICAN_MODE_
/*
 ********************************************************************************************************************
 *                          PeliCAN Ä£Ê½¼Ä´æÆ÷¶¨Òå
 ********************************************************************************************************************
 */
 /*$page*/
/*
 ********************************************************************************************************************
 * Ä£Ê½ºÍ¿ØÖÆ¼Ä´æÆ÷µÄµØÖ·ºÍÎ»¶¨ÒåPeliCANÄ£Ê½
 ********************************************************************************************************************
 */
#define         REG_CAN_MOD       0x00                      //ÄÚ²¿¿ØÖÆ¼Ä´æÆ÷

#define         RM_RR_BIT         0x01                      //¸´Î»Ä£Ê½£¨ÇëÇó£©Î»
#define         LOM_BIT           0x02                      //¼àÌıÄ£Ê½Î»
#define         STM_BIT           0x04                      //×ÔÎÒ²âÊÔÄ£Ê½Î»
#define         AFM_BIT           0x08                      //ÑéÊÕÂË²¨Æ÷Ä£Ê½Î»
#define         SM_BIT            0x10                      //Ë¯ÃßÄ£Ê½Î»

/*
 ********************************************************************************************************************
 * ÃüÁî¼Ä´æÆ÷µÄµØÖ·ºÍÎ»¶¨Òå PeliCANÄ£Ê½
 ********************************************************************************************************************
 */
#define         REG_CAN_CMR       0x01                      //ÃüÁî¼Ä´æÆ÷
#define         TR_BIT            0x01                      //·¢ËÍÇëÇóÎ»
#define         AT_BIT            0x02                      //ÖĞÖ¹·¢ËÍÎ»
#define         RRB_BIT           0x04                      //ÊÍ·Å½ÓÊÕ»º³åÆ÷Î»
#define         CDO_BIT           0x08                      //Çå³ıÊı¾İÒç³öÎ»
#define         SRR_BIT           0x10                      //×ÔÉí½ÓÊÕÇëÇóÎ»

/*
 ********************************************************************************************************************
 * ×´Ì¬¼Ä´æÆ÷µÄµØÖ·ºÍÎ»¶¨Òå PeliCANÄ£Ê½
 ********************************************************************************************************************
 */
#define         REG_CAN_SR        0x02                      //×´Ì¬¼Ä´æÆ÷

#define         RBS_BIT           0x01                      //½ÓÊÕ»º³åÆ÷×´Ì¬Î»
#define         DOS_BIT           0x02                      //Êı¾İÒç³ö×´Ì¬Î»
#define         TBS_BIT           0x04                      //·¢ËÍ»º³åÆ÷×´Ì¬Î»
#define         TCS_BIT           0x08                      //·¢ËÍÍê³É×´Ì¬Î»
#define         RS_BIT            0x10                      //½ÓÊÕ×´Ì¬Î»
#define         TS_BIT            0x20                      //·¢ËÍ×´Ì¬Î»
#define         ES_BIT            0x40                      //´íÎó×´Ì¬Î»
#define         BS_BIT            0x80                      //×ÜÏß×´Ì¬Î»

/*
 ********************************************************************************************************************
 * ÖĞ¶Ï¼Ä´æÆ÷µÄµØÖ·ºÍÎ»¶¨Òå PeliCANÄ£Ê½
 ********************************************************************************************************************
 */
#define         REG_CAN_IR        0x03                      //ÖĞ¶Ï¼Ä´æÆ÷
#define         RI_BIT            0x01                      //½ÓÊÕÖĞ¶ÏÎ»
#define         TI_BIT            0x02                      //·¢ËÍÖĞ¶ÏÎ»
#define         EI_BIT            0x04                      //´íÎó¾¯¸æÖĞ¶ÏÎ»
#define         DOI_BIT           0x08                      //Êı¾İÒç³öÖĞ¶ÏÎ»
#define         WUI_BIT           0x10                      //»½ĞÑÖĞ¶ÏÎ»
#define         EPI_BIT           0x20                      //´íÎóÏû¼«ÖĞ¶ÏÎ»
#define         ALI_BIT           0x40                      //ÖÙ²Ã¶ªÊ§ÖĞ¶ÏÎ»
#define         BEI_BIT           0x80                      //×ÜÏß´íÎóÖĞ¶ÏÎ»

/*
 ********************************************************************************************************************
 * ÖĞ¶ÏÊ¹ÄÜ¼Ä´æÆ÷µÄµØÖ·ºÍÎ»¶¨Òå PeliCANÄ£Ê½
 ********************************************************************************************************************
 */
#define         REG_CAN_IER       0x04                      //ÖĞ¶ÏÊ¹ÄÜ¼Ä´æÆ÷
#define         RIE_BIT           0x01                      //½ÓÊÕÖĞ¶ÏÊ¹ÄÜÎ»
#define         TIE_BIT           0x02                      //·¢ËÍÖĞ¶ÏÊ¹ÄÜÎ»
#define         EIE_BIT           0x04                      //´íÎó¾¯¸æÖĞ¶ÏÊ¹ÄÜÎ»
#define         DOIE_BIT          0x08                      //Êı¾İÒç³öÖĞ¶ÏÊ¹ÄÜÎ»
#define         WUIE_BIT          0x10                      //»½ĞÑÖĞ¶ÏÊ¹ÄÜÎ»
#define         EPIE_BIT          0x20                      //´íÎóÏû¼«ÖĞ¶ÏÊ¹ÄÜÎ»
#define         ALIE_BIT          0x40                      //ÖÙ²Ã¶ªÊ§ÖĞ¶ÏÊ¹ÄÜÎ»
#define         BEIE_BIT          0x80                      //×ÜÏß´íÎóÖĞ¶ÏÊ¹ÄÜÎ»

/*
 ********************************************************************************************************************
 * 0x05  ¼Ä´æÆ÷¹¦ÄÜ±£Áô
 ********************************************************************************************************************
 */

/*
 ********************************************************************************************************************
 * ×ÜÏß¶¨Ê±Æ÷¼Ä´æÆ÷µÄµØÖ·ºÍÎ»¶¨Òå PeliCANÄ£Ê½
 ********************************************************************************************************************
 */
#define         REG_CAN_BTR0      0x06                       //×ÜÏß¶¨Ê±Æ÷0¼Ä´æÆ÷
#define         REG_CAN_BTR1      0x07                      //×ÜÏß¶¨Ê±Æ÷1¼Ä´æÆ÷
#define         SAM_BIT           0x80                      //²ÉÑùÄ£Ê½Î»£»0==×ÜÏß±»²ÉÑù1´Î£»1== ×ÜÏß±»²ÉÑù3´Î

/*
 ********************************************************************************************************************
 * Êä³ö¿ØÖÆ¼Ä´æÆ÷µÄµØÖ·ºÍÎ»¶¨Òå PeliCANÄ£Ê½
 ********************************************************************************************************************
 */
#define         REG_CAN_OCR       0x08                      //Êä³ö¿ØÖÆ¼Ä´æÆ÷
           /*OCMODE1 £¬OCMODE0 */
#define         BiPhaseMode       0x00                      //Ë«ÏàÊä³öÄ£Ê½
#define         NormalMode        0x02                      //Õı³£Êä³öÄ£Ê½
#define         ClkOutMode        0x03                      //Ê±ÖÓÊä³öÄ£Ê½
           /*TX1 µÄÊä³ö¹Ü½ÅÅäÖÃ*/
#define         OCPOL1_BIT        0x20                      //Êä³ö¼«ĞÔ¿ØÖÆÎ»
#define         Tx1Float          0x00                      //ÅäÖÃÎªĞü¿Õ
#define         Tx1PullDn         0x40                      //ÅäÖÃÎªÏÂÀ­
#define         Tx1PullUp         0x80                      //ÅäÖÃÎªÉÏÀ­
#define         Tx1PshPull        0Xc0                      //ÅäÖÃÎªÍÆÍì
            /*TX0 µÄÊä³ö¹Ü½ÅÅäÖÃ*/
#define         OCPOL0_BIT        0x04                      //Êä³ö¼«ĞÔ¿ØÖÆÎ»
#define         Tx0Float          0x00                      //ÅäÖÃÎªĞü¿Õ
#define         Tx0PullDn         0x08                      //ÅäÖÃÎªÏÂÀ­
#define         Tx0PullUp         0x10                      //ÅäÖÃÎªÉÏÀ­
#define         Tx0PshPull        0X18                      //ÅäÖÃÎªÍÆÍì

/*
 ********************************************************************************************************************
 * ²âÊÔ¼Ä´æÆ÷µÄµØÖ·¶¨Òå PeliCANÄ£Ê½
 ********************************************************************************************************************
 */
#define         REG_CAN_TEST      0x09          //²âÊÔ¼Ä´æÆ÷

/*
 ********************************************************************************************************************
 * 10  ¼Ä´æÆ÷¹¦ÄÜ±£Áô
 ********************************************************************************************************************
 */

/*
 ********************************************************************************************************************
 * ÆäËû¼Ä´æÆ÷µÄµØÖ·¶¨Òå PeliCANÄ£Ê½
 ********************************************************************************************************************
 */
#define         REG_CAN_ALC       11            //ÖÙ²Ã¶ªÊ§²¶×½¼Ä´æÆ÷
#define         REG_CAN_ECC       12            //´íÎó²¶×½¼Ä´æÆ÷

#define         REG_CAN_EWLR      13            //´íÎó±¨¾¯ÏŞÖÆ¼Ä´æÆ÷

#define         REG_CAN_RXERR     14            //RX ´íÎó¼ÆÊıÆ÷¼Ä´æÆ÷

#define         REG_CAN_TXERR     15            //TX ´íÎó¼ÆÊıÆ÷¼Ä´æÆ÷

/*
 ********************************************************************************************************************
 * ÑéÊÕÂË²¨Æ÷¼Ä´æÆ÷µÄµØÖ·¶¨Òå PeliCANÄ£Ê½  ×¢£ºÖ»ÔÚ¸´Î»Ä£Ê½ÏÂÓĞĞ§
 ********************************************************************************************************************
 */
#define         REG_CAN_ACR0      16            //ÑéÊÕ´úÂë0¼Ä´æÆ÷
#define         REG_CAN_ACR1      17            //ÑéÊÕ´úÂë1¼Ä´æÆ÷
#define         REG_CAN_ACR2      18            //ÑéÊÕ´úÂë2¼Ä´æÆ÷
#define         REG_CAN_ACR3      19            //ÑéÊÕ´úÂë3¼Ä´æÆ÷

#define         REG_CAN_AMR0      20            //ÑéÊÕÆÁ±Î0¼Ä´æÆ÷
#define         REG_CAN_AMR1      21            //ÑéÊÕÆÁ±Î1¼Ä´æÆ÷
#define         REG_CAN_AMR2      22            //ÑéÊÕÆÁ±Î2¼Ä´æÆ÷
#define         REG_CAN_AMR3      23            //ÑéÊÕÆÁ±Î3¼Ä´æÆ÷


/*
 ********************************************************************************************************************
 *                          Tx »º³åÆ÷µÄµØÖ·¶¨Òå PeliCAN Ä£Ê½
 ********************************************************************************************************************
 */
 /*½öĞ´µØÖ·*/
#define         REG_CAN_TXFMINFO  16            //TX Ö¡ĞÅÏ¢(±ê×¼Ö¡¡¢À©Õ¹Ö¡£©¼Ä´æÆ÷
#define         REG_CAN_TXBUF1    17            //TX Ö¡ĞÅÏ¢(±ê×¼Ö¡¡¢À©Õ¹Ö¡£©Ê¶±ğÂë1¼Ä´æÆ÷
#define         REG_CAN_TXBUF2    18            //TX Ö¡ĞÅÏ¢(±ê×¼Ö¡¡¢À©Õ¹Ö¡£©Ê¶±ğÂë2¼Ä´æÆ÷
#define         REG_CAN_TXBUF3    19            //TX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ1¡¢À©Õ¹Ö¡Ê¶±ğÂë3£©¼Ä´æÆ÷
#define         REG_CAN_TXBUF4    20            //TX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ2¡¢À©Õ¹Ö¡Ê¶±ğÂë4£©¼Ä´æÆ÷
#define         REG_CAN_TXBUF5    21            //TX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ3¡¢À©Õ¹Ö¡Êı¾İ1£©¼Ä´æÆ÷
#define         REG_CAN_TXBUF6    22            //TX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ4¡¢À©Õ¹Ö¡Êı¾İ2£©¼Ä´æÆ÷
#define         REG_CAN_TXBUF7    23            //TX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ5¡¢À©Õ¹Ö¡Êı¾İ3£©¼Ä´æÆ÷
#define         REG_CAN_TXBUF8    24            //TX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ6¡¢À©Õ¹Ö¡Êı¾İ4£©¼Ä´æÆ÷
#define         REG_CAN_TXBUF9    25            //TX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ7¡¢À©Õ¹Ö¡Êı¾İ5£©¼Ä´æÆ÷
#define         REG_CAN_TXBUF10   26            //TX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ8¡¢À©Õ¹Ö¡Êı¾İ6£©¼Ä´æÆ÷
#define         REG_CAN_TXBUF11   27            //TX Ö¡ĞÅÏ¢             (À©Õ¹Ö¡Êı¾İ7£©¼Ä´æÆ÷
#define         REG_CAN_TXBUF12   28            //TX Ö¡ĞÅÏ¢             (À©Õ¹Ö¡Êı¾İ8£©¼Ä´æÆ÷
/*½ö¶ÁµØÖ·*/
#define         REG_CAN_TXFMRD    96            //¶ÁÈ¡TX Ö¡ĞÅÏ¢(±ê×¼Ö¡¡¢À©Õ¹Ö¡£©¼Ä´æÆ÷
#define         REG_CAN_TXRD1     97            //¶ÁÈ¡TX Ö¡ĞÅÏ¢(±ê×¼Ö¡¡¢À©Õ¹Ö¡£©Ê¶±ğÂë1¼Ä´æÆ÷
#define         REG_CAN_TXRD2     98            //¶ÁÈ¡TX Ö¡ĞÅÏ¢(±ê×¼Ö¡¡¢À©Õ¹Ö¡£©Ê¶±ğÂë2¼Ä´æÆ÷
#define         REG_CAN_TXRD3     99            //¶ÁÈ¡TX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ1¡¢À©Õ¹Ö¡Ê¶±ğÂë3£©¼Ä´æÆ÷
#define         REG_CAN_TXRD4     100           //¶ÁÈ¡TX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ2¡¢À©Õ¹Ö¡Ê¶±ğÂë4£©¼Ä´æÆ÷
#define         REG_CAN_TXRD5     101           //¶ÁÈ¡TX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ3¡¢À©Õ¹Ö¡Êı¾İ1£©¼Ä´æÆ÷
#define         REG_CAN_TXRD6     102           //¶ÁÈ¡TX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ4¡¢À©Õ¹Ö¡Êı¾İ2£©¼Ä´æÆ÷
#define         REG_CAN_TXRD7     103           //¶ÁÈ¡TX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ5¡¢À©Õ¹Ö¡Êı¾İ3£©¼Ä´æÆ÷
#define         REG_CAN_TXRD8     104           //¶ÁÈ¡TX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ6¡¢À©Õ¹Ö¡Êı¾İ4£©¼Ä´æÆ÷
#define         REG_CAN_TXRD9     105           //¶ÁÈ¡TX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ7¡¢À©Õ¹Ö¡Êı¾İ5£©¼Ä´æÆ÷
#define         REG_CAN_TXRD10    106           //¶ÁÈ¡TX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ8¡¢À©Õ¹Ö¡Êı¾İ6£©¼Ä´æÆ÷
#define         REG_CAN_TXRD11    107           //¶ÁÈ¡TX Ö¡ĞÅÏ¢             (À©Õ¹Ö¡Êı¾İ7£©¼Ä´æÆ÷
#define         REG_CAN_TXRD12    108           //¶ÁÈ¡TX Ö¡ĞÅÏ¢             (À©Õ¹Ö¡Êı¾İ8£©¼Ä´æÆ÷

/*
 ********************************************************************************************************************
 *                          Rx »º³åÆ÷µÄµØÖ·¶¨Òå PeliCAN Ä£Ê½
 ********************************************************************************************************************
 */

#define         REG_CAN_RXFMINFO  16            //RX Ö¡ĞÅÏ¢(±ê×¼Ö¡¡¢     À©Õ¹Ö¡£©¼Ä´æÆ÷
#define         REG_CAN_RXBUF1    17            //RX Ê¶±ğÂë(±ê×¼Ö¡¡¢     À©Õ¹Ö¡£©¼Ä´æÆ÷1
#define         REG_CAN_RXBUF2    18            //RX Ö¡ĞÅÏ¢(±ê×¼Ö¡¡¢     À©Õ¹Ö¡£©Ê¶±ğÂë2¼Ä´æÆ÷
#define         REG_CAN_RXBUF3    19            //RX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ1¡¢À©Õ¹Ö¡Ê¶±ğÂë3£©¼Ä´æÆ÷
#define         REG_CAN_RXBUF4    20            //RX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ2¡¢À©Õ¹Ö¡Ê¶±ğÂë4£©¼Ä´æÆ÷
#define         REG_CAN_RXBUF5    21            //RX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ3¡¢À©Õ¹Ö¡Êı¾İ1£©¼Ä´æÆ÷
#define         REG_CAN_RXBUF6    22            //RX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ4¡¢À©Õ¹Ö¡Êı¾İ2£©¼Ä´æÆ÷
#define         REG_CAN_RXBUF7    23            //RX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ5¡¢À©Õ¹Ö¡Êı¾İ3£©¼Ä´æÆ÷
#define         REG_CAN_RXBUF8    24            //RX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ6¡¢À©Õ¹Ö¡Êı¾İ4£©¼Ä´æÆ÷
#define         REG_CAN_RXBUF9    25            //RX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ7¡¢À©Õ¹Ö¡Êı¾İ5£©¼Ä´æÆ÷
#define         REG_CAN_RXBUF10   26            //RX Ö¡ĞÅÏ¢(±ê×¼Ö¡Êı¾İ8¡¢À©Õ¹Ö¡Êı¾İ6£©¼Ä´æÆ÷
#define         REG_CAN_RXBUF11   27            //RX Ö¡ĞÅÏ¢             (À©Õ¹Ö¡Êı¾İ7£©¼Ä´æÆ÷
#define         REG_CAN_RXBUF12   28            //RX Ö¡ĞÅÏ¢             (À©Õ¹Ö¡Êı¾İ8£©¼Ä´æÆ÷

#define         REG_CAN_RMC       29            //RX ĞÅÏ¢¼ÆÊıÆ÷ ¼Ä´æÆ÷

#define         REG_CAN_RBSA      30            //RX »º³åÇøÆğÊ¼µØÖ· ¼Ä´æÆ÷
/*
 ********************************************************************************************************************
/*                          Ê±ÖÓ·ÖÆµÆ÷µØÖ·ºÍÎ»¶¨Òå PeliCAN Ä£Ê½
 ********************************************************************************************************************
*/
#define         REG_CAN_CDR       0x1f            //Ê±ÖÓ·ÖÆµ ¼Ä´æÆ÷

#define         CLKOff_BIT        0x08            //Ê±ÖÓ¹Ø±ÕÎ»£¬Ê±ÖÓÊä³ö¹Ü½Å¿ØÖÆÎ»
#define         RXINTEN_BIT       0x20            //ÓÃÓÚ½ÓÊÕÖĞ¶ÏµÄ¹Ü½ÅTX1
#define         CBP_BIT           0x40            //CAN ±È½ÏÆ÷ÅÔÂ·¿ØÖÆÎ»
#define         CANMode_BIT       0x80            //CAN Ä£Ê½¿ØÖÆÎ»


/*
 ********************************************************************************************************************
 *                          PeliCAN Ä£Ê½¼Ä´æÆ÷¶¨Òå½áÊø
 ********************************************************************************************************************
 */
#endif


#ifdef		_SJA_BASICCAN_MODE_
/*
 ********************************************************************************************************************
 *                          BasicCAN Ä£Ê½¼Ä´æÆ÷¶¨Òå
 ********************************************************************************************************************
 */
 /*$page*/
/*
 ********************************************************************************************************************
 *                          ÄÚ²¿¿ØÖÆ¼Ä´æÆ÷¼°Î»¶¨Òå
 ********************************************************************************************************************
 */
#define         REG_CAN_CTR    		0x00
#define         RM_RR_BIT         	0x01               	//¸´Î»Ä£Ê½£¨ÇëÇó£©Î»
#define			RIE_BIT				0x02				//½ÓÊÕÖĞ¶ÏÊ¹ÄÜÎ»
#define			TIE_BIT				0x04				//½ÓÊÕÖĞ¶ÏÊ¹ÄÜÎ»
#define			EIE_BIT				0x08				//´íÎóÖĞ¶ÏÊ¹ÄÜÎ»
#define			OIE_BIT				0x10				//³¬ÔØÖĞ¶ÏÊ¹ÄÜÎ»

/*
 ********************************************************************************************************************
 *                          ÄÚ²¿ÃüÁî¼Ä´æÆ÷¼°Î»¶¨Òå
 ********************************************************************************************************************
 */
#define         REG_CAN_CMR       	0x01                 //ÃüÁî¼Ä´æÆ÷
#define         TR_BIT            	0x01                 //·¢ËÍÇëÇóÎ»
#define         AT_BIT            	0x02                 //ÖĞÖ¹·¢ËÍÎ»
#define         RRB_BIT           	0x04      			 //ÊÍ·Å½ÓÊÕ»º³åÆ÷Î»
#define         CDO_BIT           	0x08                 //Çå³ıÊı¾İÒç³öÎ»
#define         WU_BIT           	0x10                 //Ë¯ÃßÎ»

/*
 ********************************************************************************************************************
 * ×´Ì¬¼Ä´æÆ÷µÄµØÖ·ºÍÎ»¶¨Òå
 ********************************************************************************************************************
 */
#define         REG_CAN_SR        0x02                      //×´Ì¬¼Ä´æÆ÷

#define         RBS_BIT           0x01                      //½ÓÊÕ»º³åÆ÷×´Ì¬Î»
#define         DOS_BIT           0x02                      //Êı¾İÒç³ö×´Ì¬Î»
#define         TBS_BIT           0x04                      //·¢ËÍ»º³åÆ÷×´Ì¬Î»
#define         TCS_BIT           0x08                      //·¢ËÍÍê³É×´Ì¬Î»
#define         RS_BIT            0x10                      //½ÓÊÕ×´Ì¬Î»
#define         TS_BIT            0x20                      //·¢ËÍ×´Ì¬Î»
#define         ES_BIT            0x40                      //´íÎó×´Ì¬Î»
#define         BS_BIT            0x80                      //×ÜÏß×´Ì¬Î»

/*
 ********************************************************************************************************************
 * ÖĞ¶Ï¼Ä´æÆ÷µÄµØÖ·ºÍÎ»¶¨Òå
 ********************************************************************************************************************
 */
#define         REG_CAN_IR        0x03                      //ÖĞ¶Ï¼Ä´æÆ÷
#define         RI_BIT            0x01                      //½ÓÊÕÖĞ¶ÏÎ»
#define         TI_BIT            0x02                      //·¢ËÍÖĞ¶ÏÎ»
#define         EI_BIT            0x04                      //´íÎó¾¯¸æÖĞ¶ÏÎ»
#define         DOI_BIT           0x08                      //Êı¾İÒç³öÖĞ¶ÏÎ»
#define         WUI_BIT           0x10                      //»½ĞÑÖĞ¶ÏÎ»

/*
 ********************************************************************************************************************
 * ÑéÊÕÂË²¨Æ÷¼Ä´æÆ÷µÄµØÖ·¶¨Òå   ×¢£ºÖ»ÔÚ¸´Î»Ä£Ê½ÏÂÓĞĞ§
 ********************************************************************************************************************
 */
#define         REG_CAN_ACR       0x04            			//ÑéÊÕ´úÂë¼Ä´æÆ÷
#define         REG_CAN_AMR       0x05            			//ÑéÊÕÆÁ±Î¼Ä´æÆ÷

/*
 ********************************************************************************************************************
 * ×ÜÏß¶¨Ê±Æ÷¼Ä´æÆ÷µÄµØÖ·ºÍÎ»¶¨Òå
 ********************************************************************************************************************
 */
#define         REG_CAN_BTR0      0x06                       //×ÜÏß¶¨Ê±Æ÷0¼Ä´æÆ÷
#define         REG_CAN_BTR1      0x07                      //×ÜÏß¶¨Ê±Æ÷1¼Ä´æÆ÷
#define         SAM_BIT           0x80                      //²ÉÑùÄ£Ê½Î»£»0==×ÜÏß±»²ÉÑù1´Î£»1== ×ÜÏß±»²ÉÑù3´Î

/*
 ********************************************************************************************************************
 * Êä³ö¿ØÖÆ¼Ä´æÆ÷µÄµØÖ·ºÍÎ»¶¨Òå
 ********************************************************************************************************************
 */
#define         REG_CAN_OCR       0x08                      //Êä³ö¿ØÖÆ¼Ä´æÆ÷
           /*OCMODE1 £¬OCMODE0 */
#define         BiPhaseMode       0x00                      //Ë«ÏàÊä³öÄ£Ê½
#define         NormalMode        0x02                      //Õı³£Êä³öÄ£Ê½
#define         ClkOutMode        0x03                      //Ê±ÖÓÊä³öÄ£Ê½
           /*TX1 µÄÊä³ö¹Ü½ÅÅäÖÃ*/
#define         OCPOL1_BIT        0x20                      //Êä³ö¼«ĞÔ¿ØÖÆÎ»
#define         Tx1Float          0x00                      //ÅäÖÃÎªĞü¿Õ
#define         Tx1PullDn         0x40                      //ÅäÖÃÎªÏÂÀ­
#define         Tx1PullUp         0x80                      //ÅäÖÃÎªÉÏÀ­
#define         Tx1PshPull        0Xc0                      //ÅäÖÃÎªÍÆÍì
            /*TX0 µÄÊä³ö¹Ü½ÅÅäÖÃ*/
#define         OCPOL0_BIT        0x04                      //Êä³ö¼«ĞÔ¿ØÖÆÎ»
#define         Tx0Float          0x00                      //ÅäÖÃÎªĞü¿Õ
#define         Tx0PullDn         0x08                      //ÅäÖÃÎªÏÂÀ­
#define         Tx0PullUp         0x10                      //ÅäÖÃÎªÉÏÀ­
#define         Tx0PshPull        0X18                      //ÅäÖÃÎªÍÆÍì

/*
 ********************************************************************************************************************
 * ²âÊÔ¼Ä´æÆ÷µÄµØÖ·¶¨Òå PeliCANÄ£Ê½
 ********************************************************************************************************************
 */
#define         REG_CAN_TEST      0x09          //²âÊÔ¼Ä´æÆ÷

/*
 ********************************************************************************************************************
 * ÒÔÏÂÎª·¢ËÍ»º³åÇø¼Ä´æÆ÷¶¨Òå
 ********************************************************************************************************************
 */
#define         REG_CAN_TXBUF0    0x0A            //·¢ËÍ»º³åÇø1
#define         REG_CAN_TXBUF1    0x0B            //·¢ËÍ»º³åÇø2
#define         REG_CAN_TXBUF2    0x0C            //·¢ËÍ»º³åÇø3
#define         REG_CAN_TXBUF3    0x0D            //·¢ËÍ»º³åÇø4
#define         REG_CAN_TXBUF4    0x0E            //·¢ËÍ»º³åÇø5
#define         REG_CAN_TXBUF5    0x0F            //·¢ËÍ»º³åÇø6
#define         REG_CAN_TXBUF6    0x10            //·¢ËÍ»º³åÇø7
#define         REG_CAN_TXBUF7    0x11            //·¢ËÍ»º³åÇø8
#define         REG_CAN_TXBUF8    0x12            //·¢ËÍ»º³åÇø9
#define         REG_CAN_TXBUF9    0x13            //·¢ËÍ»º³åÇø10

/*
 ********************************************************************************************************************
 * ÒÔÏÂÎª½ÓÊÕ»º³åÇø¼Ä´æÆ÷¶¨Òå
 ********************************************************************************************************************
 */
#define         REG_CAN_RXBUF0    0x14         //½ÓÊÕ»º³åÇø1
#define         REG_CAN_RXBUF1    0x15         //½ÓÊÕ»º³åÇø2
#define         REG_CAN_RXBUF2    0x16         //½ÓÊÕ»º³åÇø3
#define         REG_CAN_RXBUF3    0x17         //½ÓÊÕ»º³åÇø4
#define         REG_CAN_RXBUF4    0x18         //½ÓÊÕ»º³åÇø5
#define         REG_CAN_RXBUF5    0x19         //½ÓÊÕ»º³åÇø6
#define         REG_CAN_RXBUF6    0x1A         //½ÓÊÕ»º³åÇø7
#define         REG_CAN_RXBUF7    0x1B         //½ÓÊÕ»º³åÇø8
#define         REG_CAN_RXBUF8    0x1C         //½ÓÊÕ»º³åÇø9
#define         REG_CAN_RXBUF9    0x1D         //½ÓÊÕ»º³åÇø10

/*
 ********************************************************************************************************************
 *                          Ê±ÖÓ·ÖÆµÆ÷µØÖ·ºÍÎ»¶¨Òå PeliCAN Ä£Ê½
 ********************************************************************************************************************
 */
//#define         REG_CAN_CDR       31            //Ê±ÖÓ·ÖÆµ ¼Ä´æÆ÷

//#define         CLKOff_BIT        0x08                      //Ê±ÖÓ¹Ø±ÕÎ»£¬Ê±ÖÓÊä³ö¹Ü½Å¿ØÖÆÎ»
//#define         RXINTEN_BIT       0x20                      //ÓÃÓÚ½ÓÊÕÖĞ¶ÏµÄ¹Ü½ÅTX1
//#define         CBP_BIT           0x40                      //CAN ±È½ÏÆ÷ÅÔÂ·¿ØÖÆÎ»
//#define         CANMode_BIT       0x80                      //CAN Ä£Ê½¿ØÖÆÎ»



/*
 ********************************************************************************************************************
 *                          BasicCAN Ä£Ê½¼Ä´æÆ÷¶¨Òå½áÊø
 ********************************************************************************************************************
 */
#endif
/*
 ********************************************************************************************************************
 *                        SJA1000¼Ä´æÆ÷¶¨Òå½áÊø
 ********************************************************************************************************************
 */
#endif


/************************************************************************
                       BASICCAN Ä£Ê½
 * ÒÔÏÂµÄ¶¨ÒåÎªSJA1000µÄÄÚ²¿¼Ä´æÆ÷µÄµØÖ·£¬²»¿ÉĞŞ¸Ä                      *
 *     ¸÷¼Ä´æÆ÷µÄ¾ßÌå¹¦ÄÜÇå²ÎÔÄsja1000µÄÊı¾İÊÖ²á                        *
 ************************************************************************/
#define         REG_CR       0x00       //ÄÚ²¿¿ØÖÆ¼Ä´æÆ÷

#define         REG_CMR           0x01       //ÃüÁî¼Ä´æÆ÷

#define         REG_SR            0x02       //×´Ì¬¼Ä´æÆ÷

#define         REG_INTERRUPT     0x03       //ÖĞ¶Ï¼Ä´æÆ÷

#define         REG_ACR           0x04       //ÑéÊÕ´úÂë¼Ä´æÆ÷

#define         REG_AMR           0x05       //ÑéÊÕÆÁ±Î¼Ä´æÆ÷

#define         REG_BTR0          0x06       //×ÜÏß¶¨Ê±¼Ä´æÆ÷0

#define         REG_BTR1          0x07       //×ÜÏß¶¨Ê±¼Ä´æÆ÷1

#define         REG_OCR           0x08       //Êä³ö¿ØÖÆ¼Ä´æÆ÷

#define         REG_TEST          0x09       //²âÊÔ¼Ä´æÆ÷
/************************************************************************
 *Ê±ÖÓ·ÖÆµ¼Ä´æÆ÷(ÄÚ²¿µØÖ·01FH)                                          *
 ************************************************************************/
#define         REG_CDR           0x1F          //Ê±ÖÓ·ÖÆµ¼Ä´æÆ÷

//ÒÔÏÂÎª·¢ËÍ»º³åÇø¼Ä´æÆ÷¶¨Òå

#define         REG_TxBuffer1     0x0A         //·¢ËÍ»º³åÇø1
#define         REG_TxBuffer2     0x0B         //·¢ËÍ»º³åÇø2
#define         REG_TxBuffer3     0x0C         //·¢ËÍ»º³åÇø3
#define         REG_TxBuffer4     0x0D         //·¢ËÍ»º³åÇø4
#define         REG_TxBuffer5     0x0E         //·¢ËÍ»º³åÇø5
#define         REG_TxBuffer6     0x0F         //·¢ËÍ»º³åÇø6
#define         REG_TxBuffer7     0x10         //·¢ËÍ»º³åÇø7
#define         REG_TxBuffer8     0x11         //·¢ËÍ»º³åÇø8
#define         REG_TxBuffer9     0x12         //·¢ËÍ»º³åÇø9
#define         REG_TxBuffer10    0x13         //·¢ËÍ»º³åÇø10

//ÒÔÏÂÎª½ÓÊÕ»º³åÇø¼Ä´æÆ÷¶¨Òå
#define         REG_RxBuffer1     0x14         //½ÓÊÕ»º³åÇø1
#define         REG_RxBuffer2     0x15         //½ÓÊÕ»º³åÇø2
#define         REG_RxBuffer3     0x16         //½ÓÊÕ»º³åÇø3
#define         REG_RxBuffer4     0x17         //½ÓÊÕ»º³åÇø4
#define         REG_RxBuffer5     0x18         //½ÓÊÕ»º³åÇø5
#define         REG_RxBuffer6     0x19         //½ÓÊÕ»º³åÇø6
#define         REG_RxBuffer7     0x1A         //½ÓÊÕ»º³åÇø7
#define         REG_RxBuffer8     0x1B         //½ÓÊÕ»º³åÇø8
#define         REG_RxBuffer9     0x1C         //½ÓÊÕ»º³åÇø9
#define         REG_RxBuffer10    0x1D         //½ÓÊÕ»º³åÇø10

/************************************************************************
 *¶¨ÒåÃüÁî×Ö                                                            *
 ************************************************************************/
#define         TR_CMD           0x01          //·¢ËÍÇëÇóÃüÁî
#define         AT_CMD           0x02          //Ø²ÕÛ·¢ËÍÃüÁî
#define         RRB_CMD          0x04          //ÊÍ·Å½ÓÊÕ»º³åÇø
#define         COS_CMD          0x08          //Çå³ı³¬ÔØ×´Ì¬
#define         GTS_CMD          0x10          //½øÈëË¯Ãß×´Ì¬ÃüÁî

/************************************************************************
 *¶¨Òå12MµÄ¾§ÌåÏÂ£¬CAN×ÜÏß²¨ÌØÂÊ                                        *
 ************************************************************************/
/*#define         ByteRate_20k      0x00          //²¨ÌØÂÊ20kbps
#define         ByteRate_40k      0x01          //²¨ÌØÂÊ40kbps
#define         ByteRate_50k      0x02          //²¨ÌØÂÊ50kbps
#define         ByteRate_80k      0x03          //²¨ÌØÂÊ80kbps
#define         ByteRate_100k     0x04          //²¨ÌØÂÊ100kbps
#define         ByteRate_125k     0x05          //²¨ÌØÂÊ125kbps
#define         ByteRate_200k     0x06          //²¨ÌØÂÊ200kbps
#define         ByteRate_250k     0x07          //²¨ÌØÂÊ250kbps
#define         ByteRate_400k     0x08          //²¨ÌØÂÊ400kbps
#define         ByteRate_500k     0x09          //²¨ÌØÂÊ500kbps
#define         ByteRate_666k     0x0a          //²¨ÌØÂÊ666kbps
#define         ByteRate_800k     0x0b          //²¨ÌØÂÊ800kbps
#define         ByteRate_1000k    0x0c          //²¨ÌØÂÊ1000kbps
*/
/*-------------------------------------------------------------------------------------------
 *  ÒÔÏÂÎªBASICCAN SJA1000µÄ´íÎó×Ö                                                          *
 -------------------------------------------------------------------------------------------*/
#define     CAN_INTERFACE_0K    0                                                        /*SJA1000½Ó¿ÚÕı³£                       */
#define     CAN_BUS_0K          0                                                       /*CAN×ÜÏß¹¤×÷Õı³£                       */
#define     CAN_INTERFACE_ERR   0XFF                                                    /*SJA1000½Ó¿Ú´íÎó£                      */
#define     CAN_ENTRESET_ERR    0XFE                                                    /*SJA1000²»ÄÜ½øÈë¸´Î»Ä£Ê½   */
#define     CAN_QUITRESET_ERR   0XFD                                                    /*SJA1000²»ÄÜÍË³ö¸´Î»Ä£Ê½       */
#define     CAN_INITOBJECT_ERR  0XFC                                                    /*³õÊ¼»¯±¨ÎÄÑéÊÕÂË²¨Æ÷´í    */
#define     CAN_INITBTR_ERR     0XFB                                                    /*³õÊ¼»¯×ÜÏß¶¨Ê±Æ÷Æ÷´í          */
#define     CAN_INITOUTCTL_ERR  0XFA                                                    /*³õÊ¼»¯Êä³ö¿ØÖÆ´íÎó            */
#define     CAN_INTCLKDIV_ERR   0XF9                                                    /*³õÊ¼»¯Ê±ÖÓ·ÖÆµ¿ØÖÆÆ÷´í        */
#define     CAN_BUS_ERR         0XF8                                                    /*SJA1000·¢ËÍÊı¾İ´í                     */

#define     NO_BANDRATE_SIZE    0xe7



















